---
kind: property
id: P:Autodesk.Revit.DB.NurbSpline.isRational
source: html/1c028df4-37db-7edf-6b35-273884dc33cb.htm
---
# Autodesk.Revit.DB.NurbSpline.isRational Property

Returns whether the nurb spline is rational or not.

## Syntax (C#)
```csharp
public bool isRational { get; }
```